Revit 2027 API
EndTreatmentType.Create(Document, String) Method
 Creates a new EndTreatmentType in the specified document and adds the input string to the endTreatment parameter.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static EndTreatmentType Create(
	Document doc,
	string treatment
)
Public Shared Function Create (
	doc As Document,
	treatment As String
) As EndTreatmentType
public:
static EndTreatmentType^ Create(
	Document^ doc,
	String^ treatment
)
static member Create :
        doc : Document *
        treatment : string -> EndTreatmentType
Parameters
doc Document
 Returns the newly created EndTreatmentType in the specified document.
treatment String
 This string will be se to the endTreatment parameter.
Return Value
EndTreatmentType
 Returns the newly created EndTreatmentType in the specified document.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Example
private void NewEndTreatmentForCouplerType(Document doc, ElementId couplerTypeId)
{
    EndTreatmentType treatmentType = EndTreatmentType.Create(doc, "Custom");
    FamilySymbol couplerType = doc.GetElement(couplerTypeId) as FamilySymbol;
    Parameter param = couplerType.get_Parameter(BuiltInParameter.COUPLER_MAIN_ENDTREATMENT);
    param.Set(treatmentType.Id);
}
See Also
Reference
EndTreatmentType Class
Create Overload
Autodesk.Revit.DB.Structure Namespace